# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
np.random.randint?

In [5]:
series1 = pd.Series(np.random.randint(1, 5, 100))
series2 = pd.Series(np.random.randint(1, 4, 100))
series3 = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.DataFrame({'bedrs' : series1, 'bathrs' : series2, 'price_sqr_meter' : series3})
df

    bedrs  bathrs  price_sqr_meter
0       2       1            16423
1       2       3            29832
2       2       1            21346
3       2       2            26780
4       4       2            14148
..    ...     ...              ...
95      3       1            15336
96      4       2            10348
97      1       1            14212
98      2       3            12278
99      1       2            10322

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [12]:
df2 = pd.DataFrame({'bigcolumn' : series3})
df2

    bigcolumn
0       16423
1       29832
2       21346
3       26780
4       14148
..        ...
95      15336
96      10348
97      14212
98      12278
99      10322

[100 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299